# taps
tap "aws/tap"
tap "candid82/brew"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "yqrashawn/goku"

# binaries
brew "aichat"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "openssl@3"
brew "cairo"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "diff-so-fancy"
brew "docker-compose"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "gnupg"
brew "go"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "hugo"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "just"
brew "openjdk"
brew "kotlin"
brew "krb5"
brew "lazygit"
brew "lsd"
brew "lsix"
brew "maven"
brew "minikube"
brew "mutt"
brew "ncdu"
brew "neomutt"
brew "neovim"
brew "nnn"
brew "node"
brew "nvm"
brew "p7zip"
brew "perl"
brew "pngpaste"
brew "postgresql@14"
brew "pstree"
brew "pup"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "spotify-tui"
brew "tealdeer"
brew "the_silver_searcher"
brew "thefuck"
brew "tilt"
brew "tmux"
brew "tree"
brew "vim", args: ["HEAD"]
brew "wget"
brew "youtube-dl"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"

# casks
cask "alacritty"
cask "alt-tab"
cask "discord"
cask "chrome"
cask "docker"
cask "flux"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "macpass"
cask "medis"
cask "obsidian"
cask "raycast"
cask "temurin"
cask "utm"

# vscode extensions
vscode "adamcowley.neo4j-vscode"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "angular.ng-template"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-emoji"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-ionic-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakeboone02.cypher-query-language"
vscode "jebbs.plantuml"
vscode "johnpapa.angular-essentials"
vscode "johnpapa.angular2"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "orsenkucher.vscode-graphql"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "shyykoserhiy.git-autoconfig"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.tanzu"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
